export const PRODUCT_NAME = 'Kode'
export const PRODUCT_URL = 'https://github.com/shareAI-lab/Anykode'
export const PROJECT_FILE = 'AGENTS.md'
export const PRODUCT_COMMAND = 'kode'
export const CONFIG_BASE_DIR = '.kode'
export const CONFIG_FILE = '.kode.json'
export const GITHUB_ISSUES_REPO_URL =
  'https://github.com/shareAI-lab/Anykode/issues'

export const ASCII_LOGO = `
██╗  ██╗ ██████╗ ██████╗ ███████╗     ██████╗██╗     ██╗
██║ ██╔╝██╔═══██╗██╔══██╗██╔════╝    ██╔════╝██║     ██║
█████╔╝ ██║   ██║██║  ██║█████╗      ██║     ██║     ██║
██╔═██╗ ██║   ██║██║  ██║██╔══╝      ██║     ██║     ██║
██║  ██╗╚██████╔╝██████╔╝███████╗    ╚██████╗███████╗██║
╚═╝  ╚═╝ ╚═════╝ ╚═════╝ ╚══════╝     ╚═════╝╚══════╝╚═╝`
